Repository: zhanibekkz00/FitArt
Catalog: frontend_flutter/lib/l10n/app_*.arb
Languages: kk

source: Profile
kk: Профиль

source: Upload photo
kk: Фото жүктеу

source: Upload failed
kk: Жүктеу қатесі

source: Photo uploaded
kk: Фото жүктелді

source: Error
kk: Қате

source: Profile details
kk: Профиль мәліметтері

source: Name
kk: Аты

source: Age
kk: Жасы

source: Gender
kk: Жынысы

source: Height
kk: Бойы

source: Weight
kk: Салмағы

source: Goal
kk: Мақсаты

source: Activity
kk: Белсенділік

source: Calculations
kk: Есептеулер

source: Target kcal
kk: Мақсат ккал

source: Protein g
kk: Ақуыз г

source: Fat g
kk: Май г

source: Carbs g
kk: Көмірсу г

source: Preferences
kk: Таңдаулар

# trainingTypes
source: Training types (comma-separated)
kk: Жаттығу түрлері (үтірмен)

# timeOfDay
source: Time of day (morning/afternoon/evening)
kk: Күн уақыты (таң/түскі/кеш)

# equipment
source: Equipment (comma-separated)
kk: Жабдық (үтірмен)

source: Save
kk: Сақтау

source: Preferences saved
kk: Таңдаулар сақталды

source: Save failed
kk: Сақтау қатесі

source: Language
kk: Тіл

# langEnglish
source: English
kk: Ағылшын

# langRussian
source: Russian
kk: Орыс

# langKazakh
source: Kazakh
kk: Қазақ

source: Sign in
kk: Кіру

source: Welcome back
kk: Қайта оралу

source: Sign in to continue
kk: Жалғастыру үшін кіріңіз

# passwordLabel
source: Password
kk: Құпия сөз

# enterValidEmail
source: Enter a valid email
kk: Дұрыс email енгізіңіз

# enterPassword
source: Enter your password
kk: Құпия сөзді енгізіңіз

# min6Chars
source: Min 6 characters
kk: Кемінде 6 таңба

# dontHaveAccount
source: Don't have an account? Create one
kk: Тіркелгі жоқ па? Жасау

# alreadyHaveAccount
source: Already have an account? Sign in
kk: Тіркелгіңіз бар ма? Кіру

source: Create account
kk: Тіркелгі жасау

# createAccountTitle
source: Create Account
kk: Тіркелгі жасау

# joinApp
source: Join FitStudent
kk: FitStudent қосылыңыз

# createAccountSubtitle
source: Create an account to get started
kk: Бастау үшін тіркелгі жасаңыз

source: Dashboard
kk: Басты бет

# profileNav
source: Profile
kk: Профиль

# activityNav
source: Activity
kk: Белсенділік

# dietNav
source: Diet
kk: Тамақтану

# progressNav
source: Progress
kk: Прогресс

# recipesNav
source: Recipes
kk: Рецепттер

source: Today
kk: Бүгін

source: Steps
kk: Қадамдар

source: Calories
kk: Калориялар

# sleepHours
source: Sleep h
kk: Ұйқы с

source: Summary
kk: Қорытынды

source: Water
kk: Су

source: Nutrition
kk: Тамақтану

source: Export CSV
kk: CSV экспорт

source: CSV Preview
kk: CSV қарау

source: Date
kk: Күні

# stepsLabel
source: Steps
kk: Қадамдар

# caloriesBurned
source: You've burned 2,500 calories this week. Amazing progress!
kk: Сіз осы аптада 2,500 калория жағдыңыз. Керемет прогресс!

# sleepHoursLabel
source: Sleep hours
kk: Ұйқы сағаттары

source: Enter steps
kk: Қадамдарды енгізіңіз

source: Enter calories
kk: Калорияларды енгізіңіз

source: Enter sleep hours
kk: Ұйқы сағаттарын енгізіңіз

source: Saved
kk: Сақталды

# milliliters
source: ml
kk: мл

source: Add
kk: Қосу

source: Water added
kk: Су қосылды

source: Food
kk: Тамақ

source: Food added
kk: Тамақ қосылды

source: Progress
kk: Прогресс

source: Last 7 Days
kk: Соңғы 7 күн

# stepsChart
source: Steps
kk: Қадамдар

# caloriesChart
source: Calories
kk: Калориялар

# sleepChart
source: Sleep (hours)
kk: Ұйқы (сағат)

# noData
source: No data available
kk: Деректер жоқ

source: Recipes
kk: Рецепттер

source: Recipe Name
kk: Рецепт атауы

source: Ingredients
kk: Ингредиенттер

source: Instructions
kk: Нұсқаулар

source: Add Recipe
kk: Рецепт қосу

source: Recipe added
kk: Рецепт қосылды

source: Diet
kk: Тамақтану

source: Daily Macros
kk: Күнделікті макрос

source: Protein
kk: Ақуыз

source: Fat
kk: Май

source: Carbs
kk: Көмірсу

source: Meal Plan
kk: Тамақтану жоспары

source: Breakfast
kk: Таңғы ас

source: Lunch
kk: Түскі ас

source: Dinner
kk: Кешкі ас

source: Snack
kk: Жеңіл тамақ

# goalLose
source: Lose Weight
kk: Арықтау

# goalMaintain
source: Maintain
kk: Ұстап тұру

# goalGain
source: Gain Weight
kk: Салмақ жинау

# activitySedentary
source: Sedentary
kk: Отырықшы

# activityModerate
source: Moderate
kk: Орташа

# activityActive
source: Active
kk: Белсенді

source: Male
kk: Ер

source: Female
kk: Әйел

source: Home
kk: Басты бет

source: Notifications
kk: Хабарландырулар

source: Mark all as read
kk: Барлығын оқылған ретінде белгілеу

source: No notifications
kk: Хабарландырулар жоқ

# allCaughtUp
source: You're all caught up!
kk: Сіз бәрін оқыдыңыз!

source: Notification deleted
kk: Хабарландыру жойылды

# newAchievement
source: New Achievement Unlocked!
kk: Жаңа жетістік құлыптан шығарылды!

# workoutStreak
source: You've completed a 7-day workout streak. Keep it up!
kk: Сіз 7 күндік жаттығу сериясын аяқтадыңыз. Жалғастырыңыз!

# timeForWorkout
source: Time for your workout
kk: Жаттығу уақыты

# eveningCardio
source: Don't forget your evening cardio session
kk: Кешкі кардио-сессияны ұмытпаңыз

# weeklyReport
source: Weekly Progress Report
kk: Апталық прогресс есебі

# reportReady
source: Your weekly fitness summary is ready to view
kk: Сіздің апталық фитнес қорытындыңыз қарауға дайын

# doingGreat
source: You're doing great!
kk: Сіз керемет жұмыс істеп жатырсыз!
